res/cf/Catalogs/СерверыПриложений1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СерверыПриложений1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПлатформы1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторизационныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МенеджерПаролей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСервера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерверПриложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерверыПриложений1С</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитИнформационныхБаз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРепозиторияГит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобиратьТэги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеСерверы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеВетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВетки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыТелеграмм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКанала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТелеграм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗащищенныеКонтуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контур</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Catalogs/СерверыПриложений1С/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПортКластера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Ссылка, "ПортКластера");
	ПортКластера = ?(ПортКластера=0, 1541, ПортКластера);
	Представление = Данные.Наименование + ":" + Формат(ПортКластера, "ЧДЦ=0; ЧГ=0");
	
КонецПроцедуры

Функция ПолучитьПараметрыСервера(Сервер) Экспорт
	
	ПараметрыАдминистрирования = АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
	ПараметрыАдминистрирования.АдресСервераАдминистрирования = Сервер.Наименование;
	ПараметрыАдминистрирования.ПортКластера = Сервер.ПортКластера;
	ПараметрыАдминистрирования.ПортСервераАдминистрирования = Сервер.ПортСервераАдминистрирования;
	ПараметрыАдминистрирования.ИмяАдминистратораКластера = Сервер.АвторизационныеДанные.Логин;
	ПараметрыАдминистрирования.ПарольАдминистратораКластера = Сервер.АвторизационныеДанные.Пароль;
	ПараметрыАдминистрирования.ТипПодключения = "RAS";
	
	Возврат ПараметрыАдминистрирования;
	
КонецФункции

Процедура ЗаполнитьПортСервераАдминистрирования() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СерверыПриложений1С.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерверыПриложений1С КАК СерверыПриложений1С
	               |ГДЕ
	               |	СерверыПриложений1С.ПортСервераАдминистрирования = 0";
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектЗаписи = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗаписи.ПортСервераАдминистрирования = ОбъектЗаписи.ПортКластера + 4;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокДляВыбора(Проект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		ВызватьИсключение "Укажите проект!";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СерверыПриложений1С.Ссылка КАК Ссылка,
	               |	СерверыПриложений1С.Представление КАК Представление
	               |ИЗ
	               |	Справочник.СерверыПриложений1С КАК СерверыПриложений1С
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты.РазрешенныеСерверы КАК ПроектыРазрешенныеСерверы
	               |		ПО СерверыПриложений1С.Сервер = ПроектыРазрешенныеСерверы.Сервер
	               |ГДЕ
	               |	ПроектыРазрешенныеСерверы.Ссылка = &Проект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Новый СписокЗначений();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ПолучитьСписокДляВыбора()

Функция ПолучитьИмяДляСтрокиСоединения(Сервер) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	СерверыПриложений1С.Представление КАК ИмяСервера
	               |ИЗ
	               |	Справочник.СерверыПриложений1С КАК СерверыПриложений1С
	               |ГДЕ
	               |	СерверыПриложений1С.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СерверыПриложений1СДополнительныеСервера.СерверПриложений.Представление
	               |ИЗ
	               |	Справочник.СерверыПриложений1С.ДополнительныеСервера КАК СерверыПриложений1СДополнительныеСервера
	               |ГДЕ
	               |	СерверыПриложений1СДополнительныеСервера.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Сервер);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ТаблицаВыгрузка = Запрос.Выполнить().Выгрузить();
	Возврат СтрСоединить(ТаблицаВыгрузка.ВыгрузитьКолонку("ИмяСервера"), ",");

КонецФункции // ПолучитьИмяДляСтрокиСоединения()
